XIVN1987/DAPLink/CH32V203/src/DAP_config.h
  GPIO_InitStruct.GPIO_Pin = JTAG_TMS_PIN;
  GPIO_Init(JTAG_TMS_PORT, &GPIO_InitStruct);

  GPIO_InitStruct.GPIO_Pin = JTAG_TDI_PIN;
  GPIO_Init(JTAG_TDI_PORT, &GPIO_InitStruct);

  GPIO_InitStruct.GPIO_Pin = JTAG_TDO_PIN;
  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_Init(JTAG_TDO_PORT, &GPIO_InitStruct);
}
 
/** Setup SWD I/O pins: SWCLK, SWDIO, and nRESET.
Configures the DAP Hardware I/O pins for Serial Wire Debug (SWD) mode:
 - SWCLK, SWDIO, nRESET to output mode and set to default high level.
 - TDI, nTRST to HighZ mode (pins are unused in SWD mode).
*/ 
__STATIC_INLINE void PORT_SWD_SETUP (void) {
  GPIO_InitTypeDef GPIO_InitStruct;

  GPIO_SetBits(SWCLK_PORT, SWCLK_PIN);
  GPIO_SetBits(SWDIO_PORT, SWDIO_PIN);

  GPIO_InitStruct.GPIO_Pin = SWCLK_PIN;
  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(SWCLK_PORT, &GPIO_InitStruct);

  GPIO_InitStruct.GPIO_Pin = SWDIO_PIN;
  GPIO_Init(SWDIO_PORT, &GPIO_InitStruct);
}

/** Disable JTAG/SWD I/O Pins.
Disables the DAP Hardware I/O pins which configures:
 - TCK/SWCLK, TMS/SWDIO, TDI, TDO, nTRST, nRESET to High-Z mode.
*/
__STATIC_INLINE void PORT_OFF (void) {
  GPIO_InitTypeDef GPIO_InitStruct;
  
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

  GPIO_InitStruct.GPIO_Pin = SWCLK_PIN;
  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(SWCLK_PORT, &GPIO_InitStruct);

  GPIO_InitStruct.GPIO_Pin = SWDIO_PIN;
  GPIO_Init(SWDIO_PORT, &GPIO_InitStruct);

  GPIO_InitStruct.GPIO_Pin = JTAG_TCK_PIN;
  GPIO_Init(JTAG_TCK_PORT, &GPIO_InitStruct);

  GPIO_InitStruct.GPIO_Pin = JTAG_TMS_PIN;
  GPIO_Init(JTAG_TMS_PORT, &GPIO_InitStruct);

  GPIO_InitStruct.GPIO_Pin = JTAG_TDI_PIN;
  GPIO_Init(JTAG_TDI_PORT, &GPIO_InitStruct);

  GPIO_InitStruct.GPIO_Pin = JTAG_TDO_PIN;
  GPIO_Init(JTAG_TDO_PORT, &GPIO_InitStruct);
}


// SWCLK/TCK I/O pin -------------------------------------

/** SWCLK/TCK I/O pin: Get Input.
\return Current status of the SWCLK/TCK DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_SWCLK_TCK_IN  (void) {
  return (SWCLK_PORT->INDR & SWCLK_PIN) ? 1 : 0;
}

/** SWCLK/TCK I/O pin: Set Output to High.
Set the SWCLK/TCK DAP hardware I/O pin to high level.
*/
__STATIC_FORCEINLINE void     PIN_SWCLK_TCK_SET (void) {
  SWCLK_PORT->BSHR = SWCLK_PIN;
}

/** SWCLK/TCK I/O pin: Set Output to Low.
Set the SWCLK/TCK DAP hardware I/O pin to low level.
*/
__STATIC_FORCEINLINE void     PIN_SWCLK_TCK_CLR (void) {
  SWCLK_PORT->BCR = SWCLK_PIN;
}


// SWDIO/TMS Pin I/O --------------------------------------

/** SWDIO/TMS I/O pin: Get Input.
\return Current status of the SWDIO/TMS DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_SWDIO_TMS_IN  (void) {
  return (SWDIO_PORT->INDR & SWDIO_PIN) ? 1 : 0;
}

/** SWDIO/TMS I/O pin: Set Output to High.
Set the SWDIO/TMS DAP hardware I/O pin to high level.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_TMS_SET (void) {
  SWDIO_PORT->BSHR = SWDIO_PIN;
}

/** SWDIO/TMS I/O pin: Set Output to Low.
Set the SWDIO/TMS DAP hardware I/O pin to low level.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_TMS_CLR (void) {
  SWDIO_PORT->BCR = SWDIO_PIN;
}

/** SWDIO I/O pin: Get Input (used in SWD mode only).
\return Current status of the SWDIO DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_SWDIO_IN      (void) {
  return (SWDIO_PORT->INDR & SWDIO_PIN) ? 1 : 0;
}

/** SWDIO I/O pin: Set Output (used in SWD mode only).
\param bit Output value for the SWDIO DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_OUT     (uint32_t bit) {
  if(bit & 1) SWDIO_PORT->BSHR = SWDIO_PIN;
  else        SWDIO_PORT->BCR  = SWDIO_PIN;
}

/** SWDIO I/O pin: Switch to Output mode (used in SWD mode only).
Configure the SWDIO DAP hardware I/O pin to output mode. This function is
called prior \ref PIN_SWDIO_OUT function calls.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_OUT_ENABLE  (void) {
  SWDIO_PORT->BCR  = SWDIO_PIN;

#if(SWDIO_PIN_INDEX < 8)
  SWDIO_PORT->CFGLR = (SWDIO_PORT->CFGLR & ~(0xF <<  SWDIO_PIN_INDEX * 4))
                                         |  (0x3 <<  SWDIO_PIN_INDEX * 4);
#else
  SWDIO_PORT->CFGHR = (SWDIO_PORT->CFGHR & ~(0xF << (SWDIO_PIN_INDEX - 8) * 4))
                                         |  (0x3 << (SWDIO_PIN_INDEX - 8) * 4);
#endif
}

/** SWDIO I/O pin: Switch to Input mode (used in SWD mode only).
Configure the SWDIO DAP hardware I/O pin to input mode. This function is
called prior \ref PIN_SWDIO_IN function calls.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_OUT_DISABLE (void) {
  SWDIO_PORT->BSHR = SWDIO_PIN;

#if(SWDIO_PIN_INDEX < 8)
  SWDIO_PORT->CFGLR = (SWDIO_PORT->CFGLR & ~(0xF <<  SWDIO_PIN_INDEX * 4))
                                         |  (0x8 <<  SWDIO_PIN_INDEX * 4);
#else
  SWDIO_PORT->CFGHR = (SWDIO_PORT->CFGHR & ~(0xF << (SWDIO_PIN_INDEX - 8) * 4))
                                         |  (0x8 << (SWDIO_PIN_INDEX - 8) * 4);
#endif
}


// TDI Pin I/O ---------------------------------------------

/** TDI I/O pin: Get Input.
\return Current status of the TDI DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_TDI_IN  (void) {
  return (JTAG_TDI_PORT->INDR & JTAG_TDI_PIN) ? 1 : 0;
}

/** TDI I/O pin: Set Output.
\param bit Output value for the TDI DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE void     PIN_TDI_OUT (uint32_t bit) {
  if(bit & 1) JTAG_TDI_PORT->BSHR = JTAG_TDI_PIN;
  else        JTAG_TDI_PORT->BCR  = JTAG_TDI_PIN;
}


// TDO Pin I/O ---------------------------------------------

/** TDO I/O pin: Get Input.
\return Current status of the TDO DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_TDO_IN  (void) {
  return (JTAG_TDO_PORT->INDR & JTAG_TDO_PIN) ? 1 : 0;
}


// nTRST Pin I/O -------------------------------------------

/** nTRST I/O pin: Get Input.
\return Current status of the nTRST DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_nTRST_IN   (void) {
  return (0U);
}

